<a href="https://colab.research.google.com/github/noushadkhan01/ML-and-DL-by-SuperDataScience/blob/master/Machine-Learning/Part%203%20-%20Classification/Section%2014%20-%20Logistic%20Regression/Logistic_Regression/Logistic_Regression_on_ad_dataset.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
!git clone https://github.com/noushadkhan01/ML-and-DL-by-SuperDataScience.git

Cloning into 'ML-and-DL-by-SuperDataScience'...
remote: Enumerating objects: 283, done.
remote: Counting objects: 100% (283/283), done.
remote: Compressing objects: 100% (225/225), done.
remote: Total 283 (delta 95), reused 196 (delta 53), pack-reused 0
Receiving objects: 100% (283/283), 25.24 MiB | 18.89 MiB/s, done.
Resolving deltas: 100% (95/95), done.

#get all methods

In [2]:
%cd ML-and-DL-by-SuperDataScience/my_methods
from my_dummy_variable import MyDummyVariable

/content/ML-and-DL-by-SuperDataScience/my_methods

In [3]:
%cd ../

/content/ML-and-DL-by-SuperDataScience

In [4]:
%cd Machine-Learning/Part 3 - Classification/Section 14 - Logistic Regression/Logistic_Regression/
!ls

/content/ML-and-DL-by-SuperDataScience/Machine-Learning/Part 3 - Classification/Section 14 - Logistic Regression/Logistic_Regression
logistic_regression.py	logistic_regression.R  Social_Network_Ads.csv

In [0]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

In [6]:
df = pd.read_csv('Social_Network_Ads.csv')
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 5 columns):
User ID            400 non-null int64
Gender             400 non-null object
Age                400 non-null int64
EstimatedSalary    400 non-null int64
Purchased          400 non-null int64
dtypes: int64(4), object(1)
memory usage: 15.7+ KB

In [8]:
df.describe()

            User ID         Age  EstimatedSalary   Purchased
count  4.000000e+02  400.000000       400.000000  400.000000
mean   1.569154e+07   37.655000     69742.500000    0.357500
std    7.165832e+04   10.482877     34096.960282    0.479864
min    1.556669e+07   18.000000     15000.000000    0.000000
25%    1.562676e+07   29.750000     43000.000000    0.000000
50%    1.569434e+07   37.000000     70000.000000    0.000000
75%    1.575036e+07   46.000000     88000.000000    1.000000
max    1.581524e+07   60.000000    150000.000000    1.000000

#Data Preprocessing

as we can see **User ID** is not an important column so we drop it

In [9]:
X = df.drop(['User ID', 'Purchased'], axis = 1)
X.head()

   Gender  Age  EstimatedSalary
0    Male   19            19000
1    Male   35            20000
2  Female   26            43000
3  Female   27            57000
4    Male   19            76000

In [10]:
evaluation = df.loc[np.random.randint(0, len(df), 3)]
evaluation

      User ID  Gender  Age  EstimatedSalary  Purchased
185  15814816    Male   31            66000          0
285  15734161  Female   37            93000          1
128  15722758    Male   30            17000          0

In [11]:
X = X.drop(evaluation.index.values)
X.shape

(397, 3)

In [12]:
X.head(1)

  Gender  Age  EstimatedSalary
0   Male   19            19000

## Dummy variable

In [0]:
ohe = MyDummyVariable()

In [14]:
X = ohe.fit_transform(X)
X[:2]

array([[1.0e+00, 1.9e+01, 1.9e+04],
       [1.0e+00, 3.5e+01, 2.0e+04]])

In [15]:
evaluation

      User ID  Gender  Age  EstimatedSalary  Purchased
185  15814816    Male   31            66000          0
285  15734161  Female   37            93000          1
128  15722758    Male   30            17000          0

In [17]:
evaluation_X = evaluation.drop(['User ID', 'Purchased'], axis = 1)
evaluation_X

     Gender  Age  EstimatedSalary
185    Male   31            66000
285  Female   37            93000
128    Male   30            17000

In [19]:
evaluation_X = ohe.transform(evaluation_X)
evaluation_X

array([[1.0e+00, 3.1e+01, 6.6e+04],
       [0.0e+00, 3.7e+01, 9.3e+04],
       [1.0e+00, 3.0e+01, 1.7e+04]])

In [18]:
evaluation_y = evaluation.Purchased
evaluation_y

185    0
285    1
128    0
Name: Purchased, dtype: int64